package main

import (
	"fmt"
	"os"
	"os/exec"
	"stegocli/cmd"
)

// var color = "\x1b[38;2;128;0;0m"
var color = "\x1b[38;2;255;85;85m"
var reset = "\x1b[0m"
var banner = color + `

  ██████ ▄▄▄█████▓▓█████   ▄████  ▒█████      ▄████▄   ██▓     ██▓
▒██    ▒ ▓  ██▒ ▓▒▓█   ▀  ██▒ ▀█▒▒██▒  ██▒   ▒██▀ ▀█  ▓██▒    ▓██▒
░ ▓██▄   ▒ ▓██░ ▒░▒███   ▒██░▄▄▄░▒██░  ██▒   ▒▓█    ▄ ▒██░    ▒██▒
  ▒   ██▒░ ▓██▓ ░ ▒▓█  ▄ ░▓█  ██▓▒██   ██░   ▒▓▓▄ ▄██▒▒██░    ░██░
▒██████▒▒  ▒██▒ ░ ░▒████▒░▒▓███▀▒░ ████▓▒░   ▒ ▓███▀ ░░██████▒░██░
▒ ▒▓▒ ▒ ░  ▒ ░░   ░░ ▒░ ░ ░▒   ▒ ░ ▒░▒░▒░    ░ ░▒ ▒  ░░ ▒░▓  ░░▓
░ ░▒  ░ ░    ░     ░ ░  ░  ░   ░   ░ ▒ ▒░      ░  ▒   ░ ░ ▒  ░ ▒ ░
░  ░  ░    ░         ░   ░ ░   ░ ░ ░ ░ ▒     ░          ░ ░    ▒ ░
      ░              ░  ░      ░     ░ ░     ░ ░          ░  ░ ░
                                             ░
` + reset

// var bold = "\x1b[44m"

func main() {
	clear := exec.Command("clear")

	clear.Stdout = os.Stdout
	clear.Run()

	fmt.Println(banner)
	cmd.Execute()

}
